# https://github.com/Homebrew/homebrew-bundle
# Devbox Brewfile - Modern development environment setup

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "homebrew/cask-fonts"

# Core tools
brew "openssl"
brew "libyaml"
brew "bash-completion"
brew "ctags"
brew "dockutil"
brew "git"
brew "htop"
brew "mas"
brew "readline"
brew "wget"
brew "tree"
brew "tmux"
brew "gpg"
brew "jq"

# Modern shell and prompt
brew "zsh"
brew "starship"

# Development tools
brew "python"
brew "pyenv"
brew "vim"
brew "neovim"
brew "thoughtbot/formulae/gitsh"
brew "ripgrep"
brew "fzf"

# Version management
brew "asdf"
brew "pnpm"

# Container and orchestration
brew "kubectl"
brew "k9s"
brew "helm"

# Browsers
cask "firefox"
cask "brave-browser"
cask "google-chrome"

# Terminal and dev tools
cask "iterm2"
cask "ghostty"
cask "raycast"
cask "sublime-text"

# Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

# Applications
cask "spotify"

# Mac App Store
mas "Slack", id: 803453959