# https://github.com/Homebrew/homebrew-bundle
# In order to speed the initial bootstrap process, this Brewfile only installs
# essentials. A more complete Brewfile is symlinked to the home directory when
# the dotfiles are installed. After the initial bootstrap is complete, run
# `brew bundle install --global`

tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"
tap "thoughtbot/formulae"

# Homebrew
# https://github.com/Homebrew/brew/
brew "openssl"
brew "libyaml"
brew "bash-completion"
brew "ctags"
brew "dockutil"
brew "git"
brew "htop"
brew "hub"
brew "mas"
brew "readline"
brew "python"
#brew "postgresql", service_restart: true
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
brew "homebrew/dupes/rsync"
brew "thoughtbot/formulae/gitsh"
brew "rg"
brew "kubectl"
brew "jq"

# homebrew-cask
# https://github.com/caskroom/homebrew-cask
cask "google-chrome"
cask "dropbox"
cask "iterm2"
cask "skype"
cask "docker"
cask "spotify"
cask "spectacle"
cask "visual-studio-code"

# mas-cli
# https://github.com/argon/mas
mas "Slack", id: 803453959