# https://github.com/Homebrew/homebrew-bundle
# In order to speed the initial bootstrap process, this Brewfile only installs
# essentials. A more complete Brewfile is symlinked to the home directory when
# the dotfiles are installed. After the initial bootstrap is complete, run
# `brew bundle install --global`

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "homebrew/cask-fonts"

# Homebrew
# https://github.com/Homebrew/brew/
brew "openssl"
brew "libyaml"
brew "bash-completion"
brew "ctags"
brew "dockutil"
brew "git"
brew "git-crypt"
brew "htop"
brew "hub"
brew "mas"
brew "readline"
brew "python"
#brew "postgresql", service_restart: true
brew "tree"
brew "vim"
brew "neovim"
brew "wget"
brew "zsh"
brew "zsh-autosuggestions"
brew "thoughtbot/formulae/gitsh"
brew "rg"
brew "kubectl"
brew "kubectx"
brew "kubernetes-helm"
brew "jq"
brew "gpg"

# homebrew-cask
# https://github.com/caskroom/homebrew-cask
cask "google-chrome"
cask "dropbox"
cask "iterm2"
cask "docker"
cask "spotify"
cask "spectacle"
cask "visual-studio-code"
cask "alfred"
cask "sublime-text"
cask "font-jetbrains-mono"
cask "font-powerline-symbols"

# mas-cli
# https://github.com/argon/mas
mas "Slack", id: 803453959
